import React from "react";

const Distinct = () => {
  return (
    <section id="distinct">
      {" "}
      <div className="distinct__inner">
        <h2 className="distinct__title">
          chanllenge <em>나의 도전</em>
        </h2>
        <div className="distinct__desc">
          <div>
            <span>1.</span>
            <h3>꿈을 설계하고 디자인하다.</h3>
            <p>
              나는 공간을 만드는 것을 좋아한다. 어려을 때부터 나만의 공간을
              만드는 것을 좋아했고 나만의 다락방을 좋아했다. 단 한 사람이라도
              내가 만든 공간 속에서 영감을 받거나 마음이 움직였으면 좋겠다.
              나만의 공간을 마음것 만들 수 있다는 건 코딩에 엄청난 매력인거
              같다. 그 한구석에 나만의 꿈을 설계하고, 개발을 하며 앞으로도 살고
              싶다.
            </p>
          </div>
          <div>
            <span>2.</span>
            <h3>꿈을 설계하고 디자인하다.</h3>
            <p>
              나는 공간을 만드는 것을 좋아한다. 어려을 때부터 나만의 공간을
              만드는 것을 좋아했고 나만의 다락방을 좋아했다. 단 한 사람이라도
              내가 만든 공간 속에서 영감을 받거나 마음이 움직였으면 좋겠다.
              나만의 공간을 마음것 만들 수 있다는 건 코딩에 엄청난 매력인거
              같다. 그 한구석에 나만의 꿈을 설계하고, 개발을 하며 앞으로도 살고
              싶다.
            </p>
          </div>
          <div>
            <span>3.</span>
            <h3>꿈을 설계하고 디자인하다.</h3>
            <p>
              나는 공간을 만드는 것을 좋아한다. 어려을 때부터 나만의 공간을
              만드는 것을 좋아했고 나만의 다락방을 좋아했다. 단 한 사람이라도
              내가 만든 공간 속에서 영감을 받거나 마음이 움직였으면 좋겠다.
              나만의 공간을 마음것 만들 수 있다는 건 코딩에 엄청난 매력인거
              같다. 그 한구석에 나만의 꿈을 설계하고, 개발을 하며 앞으로도 살고
              싶다.
            </p>
          </div>
        </div>
      </div>
    </section>
  );
};

export default Distinct;
